[
  "<pad>",
  "<sos>",
  "<eos>",
  "<unk>",
  "'",
  "'</w>",
  "</w>",
  "a",
  "a</w>",
  "aa",
  "aa</w>",
  "aaj</w>",
  "aam</w>",
  "aan",
  "aap</w>",
  "aata</w>",
  "aaya</w>",
  "ab",
  "ab</w>",
  "abhi</w>",
  "abi</w>",
  "ad</w>",
  "ada</w>",
  "af",
  "agar</w>",
  "ah",
  "ah</w>",
  "ahi</w>",
  "ahin</w>",
  "ai</w>",
  "ak</w>",
  "am</w>",
  "an",
  "an</w>",
  "ankh",
  "ankhon</w>",
  "ap",
  "apna</w>",
  "apne</w>",
  "apni</w>",
  "aq",
  "ar",
  "ar</w>",
  "are</w>",
  "as",
  "ash",
  "at</w>",
  "aur</w>",
  "az",
  "b",
  "b</w>",
  "ba",
  "ba</w>",
  "baa",
  "baat</w>",
  "bad",
  "bad</w>",
  "bah",
  "bahar</w>",
  "bahut</w>",
  "bai",
  "ban",
  "ban</w>",
  "bar",
  "bar</w>",
  "bas</w>",
  "bat</w>",
  "baz",
  "be",
  "be</w>",
  "bha",
  "bhar</w>",
  "bhi</w>",
  "bhu",
  "bi",
  "bu",
  "c",
  "ch",
  "ch</w>",
  "cha",
  "cha</w>",
  "chand</w>",
  "chash",
  "chashm</w>",
  "chch",
  "che</w>",
  "chh</w>",
  "chho",
  "chhu",
  "chu",
  "d",
  "d</w>",
  "da",
  "da</w>",
  "daa",
  "dam</w>",
  "dan</w>",
  "dar",
  "dar</w>",
  "dard</w>",
  "de",
  "de</w>",
  "dek",
  "dekh</w>",
  "dekha</w>",
  "dhar</w>",
  "di",
  "di</w>",
  "dil</w>",
  "din</w>",
  "diya</w>",
  "do",
  "do</w>",
  "du",
  "duniya</w>",
  "dush",
  "e",
  "e</w>",
  "ega</w>",
  "eh",
  "ek</w>",
  "en</w>",
  "enge</w>",
  "er",
  "f",
  "f</w>",
  "fa",
  "fa</w>",
  "far",
  "fi",
  "g",
  "g</w>",
  "ga",
  "ga</w>",
  "gah</w>",
  "gar",
  "gar</w>",
  "gaya</w>",
  "ge</w>",
  "gh",
  "ghar</w>",
  "ghh",
  "ghh</w>",
  "ghha",
  "ghhair</w>",
  "ghham</w>",
  "gi</w>",
  "gu",
  "gul</w>",
  "guzar</w>",
  "h",
  "h</w>",
  "ha",
  "ha</w>",
  "haa",
  "haath</w>",
  "hab",
  "hai</w>",
  "hain</w>",
  "hal</w>",
  "ham</w>",
  "hamar",
  "hamen</w>",
  "han",
  "han</w>",
  "har",
  "har</w>",
  "has",
  "hava</w>",
  "he",
  "he</w>",
  "hen</w>",
  "hi",
  "hi</w>",
  "hij",
  "hir</w>",
  "hiye</w>",
  "ho",
  "ho</w>",
  "hoga</w>",
  "hota</w>",
  "hta</w>",
  "hte</w>",
  "hu",
  "hua</w>",
  "hue</w>",
  "hui</w>",
  "hun",
  "hus",
  "husn</w>",
  "huun</w>",
  "i",
  "i</w>",
  "ib</w>",
  "id</w>",
  "ik</w>",
  "il</w>",
  "in",
  "in</w>",
  "ina</w>",
  "ir",
  "ir</w>",
  "ira",
  "is",
  "is</w>",
  "isa</w>",
  "ise</w>",
  "ish",
  "ish</w>",
  "ishq</w>",
  "isi</w>",
  "iye</w>",
  "iz</w>",
  "j",
  "j</w>",
  "ja",
  "ja</w>",
  "jaa",
  "jaa</w>",
  "jaan</w>",
  "jaana</w>",
  "jaane</w>",
  "jaata</w>",
  "jaate</w>",
  "jab</w>",
  "jahan</w>",
  "jal",
  "jan",
  "jan</w>",
  "ji",
  "ji</w>",
  "jis</w>",
  "jo</w>",
  "ju",
  "k",
  "k</w>",
  "ka",
  "ka</w>",
  "kaam</w>",
  "kab</w>",
  "kabhi</w>",
  "kah",
  "kahan</w>",
  "kahin</w>",
  "kahte</w>",
  "kal</w>",
  "kam</w>",
  "kan</w>",
  "kar",
  "kar</w>",
  "kare</w>",
  "karte</w>",
  "kaun</w>",
  "ke</w>",
  "kh",
  "kh</w>",
  "kha",
  "kha</w>",
  "khi",
  "khu",
  "ki",
  "ki</w>",
  "kin</w>",
  "kis</w>",
  "kisi</w>",
  "kiya</w>",
  "ko",
  "ko</w>",
  "koi</w>",
  "ku",
  "kuchh</w>",
  "kya</w>",
  "kyuun</w>",
  "l",
  "l</w>",
  "la",
  "la</w>",
  "lab</w>",
  "lag",
  "lak</w>",
  "lam</w>",
  "lat</w>",
  "le",
  "le</w>",
  "lekin</w>",
  "li",
  "li</w>",
  "lib",
  "lib'</w>",
  "liye</w>",
  "lo",
  "log</w>",
  "lon</w>",
  "lu",
  "m",
  "m</w>",
  "ma",
  "ma</w>",
  "magar</w>",
  "mah",
  "mai</w>",
  "main</w>",
  "maj",
  "man",
  "man</w>",
  "mar",
  "mar</w>",
  "mat</w>",
  "mau",
  "men</w>",
  "mera</w>",
  "mere</w>",
  "meri</w>",
  "mi",
  "mi</w>",
  "mil",
  "mil</w>",
  "min</w>",
  "mir",
  "mira</w>",
  "mire</w>",
  "miri</w>",
  "mo",
  "mohab",
  "mohabbat</w>",
  "mu",
  "muj",
  "mujh</w>",
  "mujhe</w>",
  "mun",
  "n",
  "n</w>",
  "na",
  "na</w>",
  "nahin</w>",
  "nam</w>",
  "nazar</w>",
  "nd</w>",
  "ne</w>",
  "ng",
  "ng</w>",
  "nge</w>",
  "ni",
  "ni</w>",
  "nigah</w>",
  "nik",
  "niya</w>",
  "non</w>",
  "nu",
  "nun</w>",
  "o",
  "o</w>",
  "on</w>",
  "p",
  "p</w>",
  "pa",
  "pa</w>",
  "paa",
  "pah",
  "pai",
  "par",
  "par</w>",
  "pe</w>",
  "phir</w>",
  "pu",
  "q",
  "q</w>",
  "qa",
  "qat</w>",
  "qh",
  "qh</w>",
  "qha",
  "qhaya",
  "qhi",
  "qhu",
  "qhud</w>",
  "qhuda</w>",
  "qhv",
  "qi</w>",
  "r",
  "r</w>",
  "ra",
  "ra</w>",
  "raa",
  "raat</w>",
  "rah",
  "rah</w>",
  "raha</w>",
  "rahe</w>",
  "rahi</w>",
  "rang</w>",
  "ras",
  "rat</w>",
  "re</w>",
  "ri</w>",
  "ro",
  "ru",
  "s",
  "s</w>",
  "sa",
  "sa</w>",
  "saa",
  "saath</w>",
  "sab",
  "sab</w>",
  "saf",
  "sah",
  "sak",
  "sam",
  "samaj",
  "samj",
  "san</w>",
  "sar",
  "sar</w>",
  "se</w>",
  "sh",
  "sh</w>",
  "sha",
  "sha</w>",
  "shab</w>",
  "shah",
  "shahr</w>",
  "sham</w>",
  "shan</w>",
  "shar",
  "shauq</w>",
  "shi",
  "shi</w>",
  "sho",
  "si",
  "si</w>",
  "so",
  "st</w>",
  "su",
  "sub</w>",
  "t",
  "t</w>",
  "ta",
  "ta</w>",
  "tab</w>",
  "tak</w>",
  "tama",
  "tan</w>",
  "tar",
  "tar</w>",
  "tara",
  "tarah</w>",
  "te</w>",
  "ten</w>",
  "tera</w>",
  "tere</w>",
  "teri</w>",
  "th</w>",
  "tha",
  "tha</w>",
  "the</w>",
  "thi</w>",
  "ti",
  "ti</w>",
  "tir",
  "tira</w>",
  "tire</w>",
  "tiri</w>",
  "tna</w>",
  "to</w>",
  "ton</w>",
  "tu",
  "tu</w>",
  "tuj",
  "tujh</w>",
  "tujhe</w>",
  "tum",
  "tum</w>",
  "u",
  "u</w>",
  "ul",
  "ul</w>",
  "um",
  "un",
  "un</w>",
  "uq</w>",
  "ur",
  "ur</w>",
  "us</w>",
  "use</w>",
  "ut</w>",
  "v",
  "v</w>",
  "va",
  "va</w>",
  "vaa",
  "vafa</w>",
  "vahi</w>",
  "van</w>",
  "vaq",
  "vaqt</w>",
  "var",
  "var</w>",
  "ve</w>",
  "vo</w>",
  "w",
  "y",
  "ya",
  "ya</w>",
  "yaa",
  "yaad</w>",
  "yaan</w>",
  "yaar</w>",
  "yad</w>",
  "yan</w>",
  "yar</w>",
  "yat</w>",
  "ye</w>",
  "yu",
  "yuun</w>",
  "z",
  "z</w>",
  "za",
  "za</w>",
  "zab",
  "zama",
  "zan</w>",
  "zar",
  "zar</w>",
  "zi",
  "zin",
  "zinda",
  "zindagi</w>",
  "zul"
]